#+TITLE: bspwm

#+begin_src shell :results output :export results
tree -a
#+end_src

#+RESULTS:
#+begin_example
.
├── .config
│   ├── autorandr
│   │   └── postswitch.d
│   │       └── polybars -> ../../../.local/bin/polybars
│   ├── bspwm
│   │   ├── bspwmrc
│   │   ├── dynamic_desktops
│   │   ├── env
│   │   ├── external-rules
│   │   ├── multifaceted_operation
│   │   └── smart_move
│   ├── compton.conf
│   ├── polybar
│   │   ├── config
│   │   ├── solarized-dark
│   │   └── solarized-light
│   ├── sxhkd
│   │   └── sxhkdrc
│   └── systemd
│       └── user
│           ├── graphical-session.target.wants
│           │   └── polybar@.service -> ../polybar@.service
│           └── polybar@.service
├── .local
│   └── bin
│       ├── mpvctl.sh
│       ├── polybars
│       ├── rofi-sxhkd
│       ├── scratchpad
│       ├── sxhkd-listener.sh
│       ├── sxhkd.sh
│       └── wallpaper-blur
├── README.org
├── setup.sh
├── .shell
│   └── interactive.d
│       └── bspwm.sh
├── _wallpaper
│   ├── geometric_fade.png
│   └── schicka-307-unsplash.jpg
├── .xinitrc
├── .xprofile
├── .Xresources
└── .xsession

14 directories, 30 files
#+end_example

* Dependencies
- bspwm:: window manager
- sxhkd:: hotkey daemon
- wpgtk:: theme manager
- polybar:: status bar
- rofi:: menus
- dunst: notifications
- setroot:: wallpaper
- autorander:: screen layout manager

  Tools used in the scripts:
- =wattr=
- =xdo=
- =xdotool=
- =xwinfo=
